---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertyLengthUnits
source: html/8e6bdb6a-7c73-24a0-7133-b7a424f75d02.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertyLengthUnits Property

"Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertyLengthUnits { get; }
```